* Hierarchical configuration with ~hydra~
#+PROPERTY: header-args:bash :session *conf* :eval never-export :exports both :results code
#+PROPERTY: header-args:python :eval never-export :exports both :results output code

#+begin_src elisp :exports none
(setq org-confirm-babel-evaluate nil)

(add-hook 'after-save-hook 'org-babel-tangle)
#+end_src

#+RESULTS:
| org-babel-tangle | rmail-after-save-hook |

I did some additional research into [[https://hydra.cc/docs/tutorials/basic/running_your_app/working_directory/][~hydra~]]. This is a configuration system,
created at Facebook A.I. Research. That is also where ~torch~ and [[https://www.pytorchlightning.ai/][Pytorch
Lightning]] come from, and it fits together nicely.

We use this system already for defining pretty much everything in our training
pipeline;

- Which model to use
- Which data to use
  - Where it is, what dataset type to use
  - Data augmentations (using [[https://github.com/albumentations-team/albumentations][~albumentations~]])
- How to configure the training, including ~batch_size~, acceleration strategies

There are many advantages to this system and it is also used for the new cloud
training scripts.

With the new cloud training, we need to clean up a bit our configuration system.
Our training runs were reproducible, but the options are split over [[https://github.com/SpotrAI/woco-model-training/blob/bb733ec215c8ca8539b231e36d123d11c3c80381/dvc.yaml][~dvc.yaml~]]
and the folders in [[https://github.com/SpotrAI/woco-model-training/tree/bb733ec215c8ca8539b231e36d123d11c3c80381/womt/conf][~womt/conf~]]. Below you find an example of how we can organize
the configuration for each model separately, without copy/pasting.

In addition, some ~hydra~ tricks are shown for variable interpolation and class
instantiation.

In addition, I have some snippets that show how you can quickly start
multiple configurations and how you can define experiments.

I'll start reorganising the configuration in ~woco-model-training~ along these
lines.

